#+TITLE:  Edit Bulk Configuration Files
#+AUTHOR: Howard Abrams
#+EMAIL:  howard.abrams@gmail.com
#+DATE:   [2013-05-10 Fri]

Often, I'll be given a bunch of settings for a configuration file.
While, I want to add the settings, I don't want to change any of the
comments.

This script allows me to specify a configuration file and a
collection of entries to change.

* No Input File?

  What if the input file doesn't actually exist? That should be nasty
  error.

#+BEGIN_SRC python :results output :var inputfile = "blah.txt"
  import os.path

  if not os.path.exists(inputfile):
      print "The input file specified doesn't exist.", inputfile
      exit
#+END_SRC

#+RESULTS:
: The input file specified doesn't exist. blah.txt

